Revit 2027 API
Material.CutForegroundPatternId Property
 The id of the FillPatternElement used as the foreground pattern of faces with this material in cut views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CutForegroundPatternId { get; set; }
Public Property CutForegroundPatternId As ElementId
	Get
	Set
public:
property ElementId^ CutForegroundPatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member CutForegroundPatternId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The element id must represent a valid FillPatternElement. -or- When setting this property: The FillPattern target must be a drafting pattern.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The FillPattern used for a cut foreground pattern must have a 'Drafting' target.
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace